---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPattern.BreakPattern
source: html/c03aa9c6-809c-71c1-a919-f6689afc8b74.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.BreakPattern Property

The condition which controls breaking baluster patterns distribution.

## Syntax (C#)
```csharp
public BreakPatternCondition BreakPattern { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration